app/views/tasks/edit.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."event_id" = ?  [["event_id", 4]]
---
<ul>
    <% @event.tasks.each do |t| %>