app/views/tasks/show.html.erb

<ul>
    <% @event.tasks.each do |t| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."event_id" = ?  [["event_id", 4]]