app/views/users/show.html.erb

SELECT "events".* FROM "events" WHERE (date = '2018-10-01' AND user_id = 1)
---
    <% if Event.found_event(starting_div_class + i, current_user) %>
      <ul><% Event.found_event(starting_div_class + i, current_user).each do |event| %>