app/views/events/index.html.erb

        <ul>
            <% e.tasks.each do |t| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."event_id" = ?  [["event_id", 2]]