app/views/events/show.html.erb


<ol><% @event.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."event_id" = ?  [["event_id", 34]]