app/controllers/events_controller.rb

    def show
        @event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    def edit
        @event = Event.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]

    def update
        @event = Event.find_by(id: params[:id])
        # @event.date = Date.new(params[:event]["date(1i)"].to_i, params[:event]["date(2i)"].to_i, params[:event]["date(3i)"].to_i)
         if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
UPDATE "events" SET "start_time" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["start_time", 330], ["updated_at", "2018-10-30 02:35:15.757983"], ["id", 32]]

    def create
        @event = Event.new(event_params)
        @event.user = current_user
        @event.date = Date.new(params[:event]["date(1i)"].to_i, params[:event]["date(2i)"].to_i, params[:event]["date(3i)"].to_i)
        @event.date_object = @event.date.to_date

        if @event.save
---
INSERT INTO "events" ("title", "date", "date_object", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def destroy
        @event = Event.find_by(id: params[:id])
        @event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 37]]