app/controllers/sessions_controller.rb

    def create
        #binding.pry
        if auth_hash = request.env["omniauth.auth"]
            #they logged in via OAuth
            user = User.find_or_create_by_omniauth(auth_hash)
---
INSERT INTO "users" ("username", "password_digest", "provider", "uid", "name", "oauth_token", "oauth_expires_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def login_with_credentials
        user = User.find_by(username: params[:user][:username])

        if user && user.authenticate(params[:user][:password])
            session[:user_id] = user.id
            @user = user
            redirect_to user_path(@user)
        else
            @user = User.last
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "aubs"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]