app/controllers/tasks_controller.rb

    def show
        @task = Task.find_by(id: params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
        @event = Event.find_by(id: params[:event_id])
        @task = Task.find_by(id: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @event = Event.find_by(id: params[:event_id])
        @task = Task.find_by(id: params[:id])
        @task.event = @event
        binding.pry

        if @task.update(task_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "sweep porch and decorate door"], ["updated_at", "2018-10-30 02:49:43.522346"], ["id", 8]]

    def destroy

        @task = Task.find_by(id: params[:id])
        @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 7]]

    def create
        @task = Task.new(task_params)
        @task.user = current_user
        if @task.save
---
INSERT INTO "tasks" ("description", "event_id", "user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["description", "buy gift"], ["event_id", 51], ["user_id", 1], ["status", "open"], ["created_at", "2018-10-30 03:10:01.207776"], ["updated_at", "2018-10-30 03:10:01.207776"]]

    def create_from_event
        @task = Task.new(task_params)
        @task.user = current_user
        @task.save
---
INSERT INTO "tasks" ("description", "event_id", "user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["description", "make reso"], ["event_id", 51], ["user_id", 1], ["status", "open"], ["created_at", "2018-10-30 03:46:08.896149"], ["updated_at", "2018-10-30 03:46:08.896149"]]