app/controllers/users_controller.rb

    def create
      @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "ira"], ["password_digest", "$2a$10$ZUY/MB.eglDIwuhonPkwReClBgG10N16hXYx344H7H6lEvaGad27K"], ["created_at", "2018-07-10 21:09:34.936503"], ["updated_at", "2018-07-10 21:09:34.936503"]]

    def show
      if logged_in?
        @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]